
/*Практическое задание
Дан трёхмерный массив:
int[,,] mas = {
    { { 1, 2 }, { 3, 4 } },
    { { 4, 5 }, { 6, 7 } },
    { { 7, 8 }, { 9, 10 } },
    { { 10, 11 }, { 12, 13 } }
};
Вывести все элементы в формате:
text
{{{1 , 2} , {3 , 4}} , {{4 , 5} , {6 , 7}} , {{7 , 8}, {9 , 10}} , {{10 , 11} , {12 , 13}}}
*/

using System;

class Program
{
    static void Main()
    {
        int[,,] mas = {
            { { 1, 2 }, { 3, 4 } },
            { { 4, 5 }, { 6, 7 } },
            { { 7, 8 }, { 9, 10 } },
            { { 10, 11 }, { 12, 13 } }
        };

        Console.Write("{");
        
        // Первый уровень - 4 элемента
        for (int i = 0; i < 4; i++)
        {
            if (i > 0) Console.Write(" , ");
            Console.Write("{");
            
            // Второй уровень - 2 элемента
            for (int j = 0; j < 2; j++)
            {
                if (j > 0) Console.Write(" , ");
                Console.Write("{");
                
                // Третий уровень - 2 элемента
                for (int k = 0; k < 2; k++)
                {
                    if (k > 0) Console.Write(" , ");
                    Console.Write(mas[i, j, k]);
                }
                
                Console.Write("}"); //не переводит на новую строку 
            }
            
            Console.Write("}");
        }
        
        Console.WriteLine("}"); //а тут переходит
    }
}
